espressif/esp-idf/components/soc/esp32h21/register/soc/usb_serial_jtag_struct.h
/** Type of serial_jtag_mem_conf register
 *  Memory power control
 */
typedef union {
    struct {
        /** serial_jtag_usb_mem_pd : R/W; bitpos: [0]; default: 0;
         *  1: power down usb memory.
         */
        uint32_t serial_jtag_usb_mem_pd:1;
        /** serial_jtag_usb_mem_clk_en : R/W; bitpos: [1]; default: 1;
         *  1: Force clock on for usb memory.
         */
        uint32_t serial_jtag_usb_mem_clk_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} usb_serial_jtag_mem_conf_reg_t;

/** Type of serial_jtag_chip_rst register
 *  CDC-ACM chip reset control.
 */
typedef union {
    struct {
        /** serial_jtag_rts : RO; bitpos: [0]; default: 0;
         *  1: Chip reset is detected from usb serial channel. Software write 1 to clear it.
         */
        uint32_t serial_jtag_rts:1;
        /** serial_jtag_dtr : RO; bitpos: [1]; default: 0;
         *  1: Chip reset is detected from usb jtag channel. Software write 1 to clear it.
         */
        uint32_t serial_jtag_dtr:1;
        /** serial_jtag_usb_uart_chip_rst_dis : R/W; bitpos: [2]; default: 0;
         *  Set this bit to disable chip reset from usb serial channel to reset chip.
         */
        uint32_t serial_jtag_usb_uart_chip_rst_dis:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} usb_serial_jtag_chip_rst_reg_t;

/** Type of serial_jtag_get_line_code_w0 register
 *  W0 of GET_LINE_CODING command.
 */
typedef union {
    struct {
        /** serial_jtag_get_dw_dte_rate : R/W; bitpos: [31:0]; default: 0;
         *  The value of dwDTERate set by software which is requested by GET_LINE_CODING
         *  command.
         */
        uint32_t serial_jtag_get_dw_dte_rate:32;
    };
    uint32_t val;
} usb_serial_jtag_get_line_code_w0_reg_t;

/** Type of serial_jtag_get_line_code_w1 register
 *  W1 of GET_LINE_CODING command.
 */
typedef union {
    struct {
        /** serial_jtag_get_bdata_bits : R/W; bitpos: [7:0]; default: 0;
         *  The value of bCharFormat set by software which is requested by GET_LINE_CODING
         *  command.
         */
        uint32_t serial_jtag_get_bdata_bits:8;
        /** serial_jtag_get_bparity_type : R/W; bitpos: [15:8]; default: 0;
         *  The value of bParityTpye set by software which is requested by GET_LINE_CODING
         *  command.
         */
        uint32_t serial_jtag_get_bparity_type:8;
        /** serial_jtag_get_bchar_format : R/W; bitpos: [23:16]; default: 0;
         *  The value of bDataBits set by software which is requested by GET_LINE_CODING
         *  command.
         */
        uint32_t serial_jtag_get_bchar_format:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} usb_serial_jtag_get_line_code_w1_reg_t;

/** Type of serial_jtag_config_update register
 *  Configuration registers' value update
 */
typedef union {
    struct {
        /** serial_jtag_config_update : WT; bitpos: [0]; default: 0;
         *  Write 1 to this register would update the value of configure registers from APB
         *  clock domain to 48MHz clock domain.
         */
        uint32_t serial_jtag_config_update:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} usb_serial_jtag_config_update_reg_t;

/** Type of serial_jtag_ser_afifo_config register
 *  Serial AFIFO configure register
 */
typedef union {
    struct {
        /** serial_jtag_serial_in_afifo_reset_wr : R/W; bitpos: [0]; default: 0;
         *  Write 1 to reset CDC_ACM IN async FIFO write clock domain.
         */
        uint32_t serial_jtag_serial_in_afifo_reset_wr:1;
        /** serial_jtag_serial_in_afifo_reset_rd : R/W; bitpos: [1]; default: 0;
         *  Write 1 to reset CDC_ACM IN async FIFO read clock domain.
         */
        uint32_t serial_jtag_serial_in_afifo_reset_rd:1;
        /** serial_jtag_serial_out_afifo_reset_wr : R/W; bitpos: [2]; default: 0;
         *  Write 1 to reset CDC_ACM OUT async FIFO write clock domain.
         */
        uint32_t serial_jtag_serial_out_afifo_reset_wr:1;
        /** serial_jtag_serial_out_afifo_reset_rd : R/W; bitpos: [3]; default: 0;
         *  Write 1 to reset CDC_ACM OUT async FIFO read clock domain.
         */
        uint32_t serial_jtag_serial_out_afifo_reset_rd:1;
        /** serial_jtag_serial_out_afifo_rempty : RO; bitpos: [4]; default: 1;
         *  CDC_ACM OUTPUT async FIFO empty signal in read clock domain.
         */
        uint32_t serial_jtag_serial_out_afifo_rempty:1;
        /** serial_jtag_serial_in_afifo_wfull : RO; bitpos: [5]; default: 0;
         *  CDC_ACM OUT IN async FIFO empty signal in write clock domain.
         */
        uint32_t serial_jtag_serial_in_afifo_wfull:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} usb_serial_jtag_ser_afifo_config_reg_t;

/** Type of serial_jtag_serial_ep_timeout0 register
 *  USB uart out endpoint timeout configuration.
 */
typedef union {
    struct {
        /** serial_jtag_serial_timeout_en : R/W; bitpos: [0]; default: 0;
         *  USB serial out ep timeout enable. When a timeout event occurs, serial out ep buffer
         *  is automatically cleared and reg_serial_timeout_status is asserted.
         */
        uint32_t serial_jtag_serial_timeout_en:1;
        /** serial_jtag_serial_timeout_status : R/WTC/SS; bitpos: [1]; default: 0;
         *  Serial out ep triggers a timeout event.
         */
        uint32_t serial_jtag_serial_timeout_status:1;
        /** serial_jtag_serial_timeout_status_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear reg_serial_timeout_status.
         */
        uint32_t serial_jtag_serial_timeout_status_clr:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} usb_serial_jtag_serial_ep_timeout0_reg_t;

/** Type of serial_jtag_serial_ep_timeout1 register
 *  USB uart out endpoint timeout configuration.
 */
typedef union {
    struct {
        /** serial_jtag_serial_timeout_max : R/W; bitpos: [31:0]; default: 4800768;
         *  USB serial out ep timeout max threshold value, indicates the maximum time that
         *  waiting for ESP to take away data in memory. This value is in steps of 20.83ns.
         */
        uint32_t serial_jtag_serial_timeout_max:32;
    };
    uint32_t val;
} usb_serial_jtag_serial_ep_timeout1_reg_t;


/** Group: Interrupt Registers */
/** Type of serial_jtag_int_raw register
 *  Interrupt raw status register.
 */
typedef union {
    struct {
        /** serial_jtag_jtag_in_flush_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when flush cmd is received for IN
         *  endpoint 2 of JTAG.
         */
        uint32_t serial_jtag_jtag_in_flush_int_raw:1;
        /** serial_jtag_sof_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when SOF frame is received.
         */
        uint32_t serial_jtag_sof_int_raw:1;
        /** serial_jtag_serial_out_recv_pkt_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when Serial Port OUT Endpoint received
         *  one packet.
         */
        uint32_t serial_jtag_serial_out_recv_pkt_int_raw:1;
        /** serial_jtag_serial_in_empty_int_raw : R/WTC/SS; bitpos: [3]; default: 1;
         *  The raw interrupt bit turns to high level when Serial Port IN Endpoint is empty.
         */
        uint32_t serial_jtag_serial_in_empty_int_raw:1;
        /** serial_jtag_pid_err_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when pid error is detected.
         */
        uint32_t serial_jtag_pid_err_int_raw:1;
        /** serial_jtag_crc5_err_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit turns to high level when CRC5 error is detected.
         */
        uint32_t serial_jtag_crc5_err_int_raw:1;
        /** serial_jtag_crc16_err_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit turns to high level when CRC16 error is detected.
         */
        uint32_t serial_jtag_crc16_err_int_raw:1;
        /** serial_jtag_stuff_err_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit turns to high level when stuff error is detected.
         */
        uint32_t serial_jtag_stuff_err_int_raw:1;
        /** serial_jtag_in_token_rec_in_ep1_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit turns to high level when IN token for IN endpoint 1 is
         *  received.
         */
        uint32_t serial_jtag_in_token_rec_in_ep1_int_raw:1;
        /** serial_jtag_usb_bus_reset_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit turns to high level when usb bus reset is detected.
         */
        uint32_t serial_jtag_usb_bus_reset_int_raw:1;
        /** serial_jtag_out_ep1_zero_payload_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit turns to high level when OUT endpoint 1 received packet with
         *  zero palyload.
         */
        uint32_t serial_jtag_out_ep1_zero_payload_int_raw:1;
        /** serial_jtag_out_ep2_zero_payload_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit turns to high level when OUT endpoint 2 received packet with
         *  zero palyload.
         */
        uint32_t serial_jtag_out_ep2_zero_payload_int_raw:1;
        /** serial_jtag_rts_chg_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit turns to high level when level of RTS from usb serial channel
         *  is changed.
         */
        uint32_t serial_jtag_rts_chg_int_raw:1;
        /** serial_jtag_dtr_chg_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw interrupt bit turns to high level when level of DTR from usb serial channel
         *  is changed.
         */
        uint32_t serial_jtag_dtr_chg_int_raw:1;
        /** serial_jtag_get_line_code_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  The raw interrupt bit turns to high level when level of GET LINE CODING request is
         *  received.
         */
        uint32_t serial_jtag_get_line_code_int_raw:1;
        /** serial_jtag_set_line_code_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  The raw interrupt bit turns to high level when level of SET LINE CODING request is
         *  received.
         */
        uint32_t serial_jtag_set_line_code_int_raw:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} usb_serial_jtag_int_raw_reg_t;

/** Type of serial_jtag_int_st register
 *  Interrupt status register.
 */
typedef union {
    struct {
        /** serial_jtag_jtag_in_flush_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_JTAG_IN_FLUSH_INT interrupt.
         */
        uint32_t serial_jtag_jtag_in_flush_int_st:1;
        /** serial_jtag_sof_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_SOF_INT interrupt.
         */
        uint32_t serial_jtag_sof_int_st:1;
        /** serial_jtag_serial_out_recv_pkt_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_SERIAL_OUT_RECV_PKT_INT
         *  interrupt.
         */
        uint32_t serial_jtag_serial_out_recv_pkt_int_st:1;
        /** serial_jtag_serial_in_empty_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_SERIAL_IN_EMPTY_INT interrupt.
         */
        uint32_t serial_jtag_serial_in_empty_int_st:1;
        /** serial_jtag_pid_err_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_PID_ERR_INT interrupt.
         */
        uint32_t serial_jtag_pid_err_int_st:1;
        /** serial_jtag_crc5_err_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_CRC5_ERR_INT interrupt.
         */
        uint32_t serial_jtag_crc5_err_int_st:1;
        /** serial_jtag_crc16_err_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_CRC16_ERR_INT interrupt.
         */
        uint32_t serial_jtag_crc16_err_int_st:1;
        /** serial_jtag_stuff_err_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_STUFF_ERR_INT interrupt.
         */
        uint32_t serial_jtag_stuff_err_int_st:1;
        /** serial_jtag_in_token_rec_in_ep1_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_IN_TOKEN_REC_IN_EP1_INT
         *  interrupt.
         */
        uint32_t serial_jtag_in_token_rec_in_ep1_int_st:1;
        /** serial_jtag_usb_bus_reset_int_st : RO; bitpos: [9]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_USB_BUS_RESET_INT interrupt.
         */
        uint32_t serial_jtag_usb_bus_reset_int_st:1;
        /** serial_jtag_out_ep1_zero_payload_int_st : RO; bitpos: [10]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_OUT_EP1_ZERO_PAYLOAD_INT
         *  interrupt.
         */
        uint32_t serial_jtag_out_ep1_zero_payload_int_st:1;
        /** serial_jtag_out_ep2_zero_payload_int_st : RO; bitpos: [11]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_OUT_EP2_ZERO_PAYLOAD_INT
         *  interrupt.
         */
        uint32_t serial_jtag_out_ep2_zero_payload_int_st:1;
        /** serial_jtag_rts_chg_int_st : RO; bitpos: [12]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_RTS_CHG_INT interrupt.
         */
        uint32_t serial_jtag_rts_chg_int_st:1;
        /** serial_jtag_dtr_chg_int_st : RO; bitpos: [13]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_DTR_CHG_INT interrupt.
         */
        uint32_t serial_jtag_dtr_chg_int_st:1;
        /** serial_jtag_get_line_code_int_st : RO; bitpos: [14]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_GET_LINE_CODE_INT interrupt.
         */
        uint32_t serial_jtag_get_line_code_int_st:1;
        /** serial_jtag_set_line_code_int_st : RO; bitpos: [15]; default: 0;
         *  The raw interrupt status bit for the USB_SERIAL_JTAG_SET_LINE_CODE_INT interrupt.
         */
        uint32_t serial_jtag_set_line_code_int_st:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} usb_serial_jtag_int_st_reg_t;

