espressif/esp-idf/components/soc/esp32h21/register/soc/usb_serial_jtag_struct.h
/** Group: Version Registers */
/** Type of serial_jtag_date register
 *  Date register
 */
typedef union {
    struct {
        /** serial_jtag_date : R/W; bitpos: [31:0]; default: 37777456;
         *  register version.
         */
        uint32_t serial_jtag_date:32;
    };
    uint32_t val;
} usb_serial_jtag_date_reg_t;


typedef struct {
    volatile usb_serial_jtag_ep1_reg_t serial_jtag_ep1;
    volatile usb_serial_jtag_ep1_conf_reg_t serial_jtag_ep1_conf;
    volatile usb_serial_jtag_int_raw_reg_t serial_jtag_int_raw;
    volatile usb_serial_jtag_int_st_reg_t serial_jtag_int_st;
    volatile usb_serial_jtag_int_ena_reg_t serial_jtag_int_ena;
    volatile usb_serial_jtag_int_clr_reg_t serial_jtag_int_clr;
    volatile usb_serial_jtag_conf0_reg_t serial_jtag_conf0;
    volatile usb_serial_jtag_test_reg_t serial_jtag_test;
    volatile usb_serial_jtag_jfifo_st_reg_t serial_jtag_jfifo_st;
    volatile usb_serial_jtag_fram_num_reg_t serial_jtag_fram_num;
    volatile usb_serial_jtag_in_ep0_st_reg_t serial_jtag_in_ep0_st;
    volatile usb_serial_jtag_in_ep1_st_reg_t serial_jtag_in_ep1_st;
    volatile usb_serial_jtag_in_ep2_st_reg_t serial_jtag_in_ep2_st;
    volatile usb_serial_jtag_in_ep3_st_reg_t serial_jtag_in_ep3_st;
    volatile usb_serial_jtag_out_ep0_st_reg_t serial_jtag_out_ep0_st;
    volatile usb_serial_jtag_out_ep1_st_reg_t serial_jtag_out_ep1_st;
    volatile usb_serial_jtag_out_ep2_st_reg_t serial_jtag_out_ep2_st;
    volatile usb_serial_jtag_misc_conf_reg_t serial_jtag_misc_conf;
    volatile usb_serial_jtag_mem_conf_reg_t serial_jtag_mem_conf;
    volatile usb_serial_jtag_chip_rst_reg_t serial_jtag_chip_rst;
    volatile usb_serial_jtag_set_line_code_w0_reg_t serial_jtag_set_line_code_w0;
    volatile usb_serial_jtag_set_line_code_w1_reg_t serial_jtag_set_line_code_w1;
    volatile usb_serial_jtag_get_line_code_w0_reg_t serial_jtag_get_line_code_w0;
    volatile usb_serial_jtag_get_line_code_w1_reg_t serial_jtag_get_line_code_w1;
    volatile usb_serial_jtag_config_update_reg_t serial_jtag_config_update;
    volatile usb_serial_jtag_ser_afifo_config_reg_t serial_jtag_ser_afifo_config;
    volatile usb_serial_jtag_bus_reset_st_reg_t serial_jtag_bus_reset_st;
    volatile usb_serial_jtag_serial_ep_timeout0_reg_t serial_jtag_serial_ep_timeout0;
    volatile usb_serial_jtag_serial_ep_timeout1_reg_t serial_jtag_serial_ep_timeout1;
    uint32_t reserved_074[3];
    volatile usb_serial_jtag_date_reg_t serial_jtag_date;
} usb_serial_jtag_dev_t;

extern usb_serial_jtag_dev_t USB_SERIAL_JTAG;

#ifndef __cplusplus
_Static_assert(sizeof(usb_serial_jtag_dev_t) == 0x84, "Invalid size of usb_serial_jtag_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
